package study11;

public class gitHub {

	/*
	 * (1) git허브
	 	 - 리눅스 회사에서 제공 해주는 웹으로 운영되는 저장(공간) 프로그램
	 	 - 전세계 누구나 사용 가능한 프로그램
	 *  
	 *  git 허브   :: 개인용
	 * 			  :: 웹상에서의 저장공간
	 * 			  :: {공인된서버}의 일부공간을 제공받아서 사용하는 것을 의미
	 * 			  :: {리눅스}만든 회사
	 * 			==> 윈도우(유료), 리눅스(무료), 맥킨토시(유료)
	 * 
	 * (2) 웹하드(유료) - only 개인 
	 	- {공인된서버}의 일부공간을 제공하여 사용자에게 제공해주는 사이트
	 	
	 --------------------------------------------------------------
	 * (2) git :: 프로젝트용 프로그램
	 * 	   svn :: 프로젝트용 프로그램
	 */
}
